Конфигурация/Documents/Debt.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Debt</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Debts</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Operation</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OperationTypeDebt</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterParties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Sum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Field1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/Debts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>Debts</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Sum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterParties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/OperationTypeDebt.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>OperationTypeDebt</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>IGotInDebt</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IAmInDebt</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IReturnedDebt</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IReturnedTheDebt</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/Debt/Ext/ObjectModule.bsl
Procedure Posting(Cancel, Mode)
	RegisterRecords.Debts.Clear();
	RegisterRecords.Debts.Write = True;
	Record             = RegisterRecords.Debts.Add();
	IF Operation = Enums.OperationTypeDebt.IGotInDebt Then
		Record.RecordType = AccumulationRecordType.Receipt;
		Record.Sum       = Sum;
	ElsIf Operation = Enums.OperationTypeDebt.IReturnedDebt Then
		Record.RecordType = AccumulationRecordType.Expense;
		Record.Sum       = Sum;
	ElsIf Operation = Enums.OperationTypeDebt.IAmInDebt Then
		Record.RecordType = AccumulationRecordType.Receipt;
		Record.Sum       = -Sum;
	ElsIf Operation = Enums.OperationTypeDebt.IReturnedTheDebt Then
		Record.RecordType = AccumulationRecordType.Expense;
		Record.Sum       = -Sum;
	EndIf;
	Record.Period      = Date;
	Record.Counterparty  = Counterparty;
	Record.Currency      = Currency;
EndProcedure

Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	IF Not ValueIsFilled(Currency) Then
		Currency = Constants.MainCurrency.Get();
	EndIf;	
EndProcedure
